/* decode  - exam */

-- birth를 이용하여 출력하세요
-- 2010년대 : 0대, 2000년대: 10대, 1990 : 20대, 1980 : 30대, 1970 : 40대, 1960 : 50대

select name, birth,
decode(trunc(to_char(birth, 'yyyy'),-1),2010, 0, 2000, 10, 1990, 20, 1980, 30, 1970, 40, 1960, 50) as age
from member;

--박성언	90/05/12	20
--김영재	90/12/11	20
--호이호이	88/08/08	30
--홍길동	50/04/25	
--크리스마스	98/12/25	20
--식목일	01/04/05	10

-- trunc 옵션에 -1 을 하면 뒤에서 한자리수를 버리지만, 자리수는 바뀌지 않습니다.

-- 버림
select 
trunc(123.456789, 2), -- 123.45
trunc(-123.456789, 3), -- -123.456
trunc(987.456789, 4), -- 987.4567
trunc(-987.456789, 5), -- -987.45678
trunc(-987.456789, -1) -- -980
from dual;