package memo;

public class Memo {

	// JSP Ajax 고급 회원제 채팅 사이트 개발하기
	// https://www.youtube.com/watch?v=88eNrWzLk-A&list=PLRx0vPvlEmdAlUbX_TGDxaSxKCvfl2isa

	// 2020-08-22 1강 까지 완료 - 프로젝트 소개 및 화면 디자인
	// 2020-08-22 2강 까지 완료 - 데이터베이스 커넥션 풀 구축

	// 2020-08-23 3강 까지 완료 - 회원 등록 양식 디자인
	// 2020-08-23 4강 까지 완료 - 회원 가입 DB 기능 구현
	// 2020-08-23 5강 까지 완료 - 모달 팝업창 및 회원가입 기능 완성

	// 2020-08-24 6강 까지 완료 - 채팅창 디자인 구현
	// 2020-08-24 7강 까지 완료 - 채팅 데이터베이스 구축
	// 2020-08-24 8강 까지 완료 - 채팅 메시지 전송 기능 구현
	// 2020-08-24 9강 까지 완료 - 로그인 디자인 및 기능 구현
	// 2020-08-24 10강 까지 완료 - 채팅내용 불러오기

}
