package memo;

public class Memo {

	// JSP Ajax 고급 회원제 채팅 사이트 개발하기
	// https://www.youtube.com/watch?v=88eNrWzLk-A&list=PLRx0vPvlEmdAlUbX_TGDxaSxKCvfl2isa

	// 2020-08-22 1강 까지 완료 - 프로젝트 소개 및 화면 디자인
	// 2020-08-22 2강 까지 완료 - 데이터베이스 커넥션 풀 구축

	// 2020-08-23 3강 까지 완료 - 회원 등록 양식 디자인
	// 2020-08-23 4강 까지 완료 - 회원 가입 DB 기능 구현
	// 2020-08-23 5강 까지 완료 - 모달 팝업창 및 회원가입 기능 완성

	// 2020-08-24 6강 까지 완료 - 채팅창 디자인 구현
	// 2020-08-24 7강 까지 완료 - 채팅 데이터베이스 구축
	// 2020-08-24 8강 까지 완료 - 채팅 메시지 전송 기능 구현
	// 2020-08-24 9강 까지 완료 - 로그인 디자인 및 기능 구현
	// 2020-08-24 10강 까지 완료 - 채팅내용 불러오기

	// 2020-08-26 11강 까지 완료 - 친구 찾기 기능 구현
	// 2020-08-26 12강 까지 완료 - 메인 디자인 개편하기

	// 2020-08-27 13강 까지 완료 - 메시지 읽음 처리 구현
	// 2020-08-27 14강 까지 완료 - 읽지 않은 메시지 갯수 출력 기능 구현
	// 2020-08-27 15강 6분30초 까지 완료 - 메시지함 기능 구현

	// 2020-08-28 15강 6분30초 부터 끝 까지 완료 - 메시지함 기능 구현
	// 2020-08-28 16강 까지 완료 - 메시지 전송 예외처리
	// 2020-08-28 17강 까지 완료 - 대화상대별 안 읽은 메시지 출력 + (뇌피셜 : chat.jsp 에서 존재하지 않는 사용자에게
	// 메시지 보내기 기능 차단)
	// 2020-08-28 18강 10분 까지 완료 - 회원정보수정 기능 구현

	// 2020-08-29 18강 10분 부터 끝 완료 - 회원정보수정 기능 구현
	// 2020-08-29 19강 까지 완료 - 프로필 사진 업로드 기능 구현

	// 2020-08-31 20강 까지 완료 - 프로필 사진 출력 기능 구현
	// 2020-08-31 21강 까지 완료 - 회원제 댓글형 게시판 설계
	// 2020-08-31 22강 까지 완료 - 파일 및 게시글 등록 기능 구현

	// 2020-09-01 23강 까지 완료 - 게시판 글 목록 출력 기능 구현
	// 2020-09-01 24강 까지 완료 - 게시글 첨부파일 다운로드 구현 (난이도 : 상)

	// 2020-09-02 25강 까지 완료 - 게시글 수정 기능 구현
	// 2020-09-02 26강 까지 완료 - 게시글 삭제 기능 구현

	// 2020-09-03 267 까지 완료 - 게시글 답변 기능 구현

}
