package memo;

public class Memo {

	// JSP 게시판 만들기 강좌
	// https://www.youtube.com/watch?v=wEIBDHfoMBg&list=PLRx0vPvlEmdAZv_okJzox5wj2gG_fNh_6

	// 2020-08-20 1강 까지 완료 - 강의 소개 및 과정 소개
	// 2020-08-20 2강 까지 완료 - 로그인 페이지 디자인
	// 2020-08-20 3강 까지 완료 - 회원 데이터베이스 구축하기
	// 2020-08-20 4강 까지 완료 - 로그인 기능 구현하기
	// 2020-08-20 5강 까지 완료 - 회원가입 페이지 디자인
	// 2020-08-20 6강 3분 21초 까지 완료 - 회원가입 기능 구현하기

	// 2020-08-21 6강 3분 21초 부터 끝까지 완료 - 회원가입 기능 구현하기
	// 2020-08-21 7강 까지 완료 - 접속한 회원 세션 관리하기
	// 2020-08-21 8강 까지 완료 - 게시판 메인 페이지 디자인
	// 2020-08-21 9강 까지 완료 - 게시판 데이터베이스 구축하기
	// 2020-08-21 10강 까지 완료 - 글쓰기 기능 구현하기
	// 2020-08-21 11강 10분 까지 완료 - 게시판 글 목록 기능 구현하기

	// 2020-08-22 11강 10분 부터 끝까지 완료 - 게시판 글 목록 기능 구현하기
	// 2020-08-22 12강 까지 완료 - 게시글 보기 기능 구현하기
	// 2020-08-22 13강 까지 완료 - 게시글 수정 및 삭제 기능 구현하기
	// 2020-08-22 14강 까지 완료 - 웹 사이트 메인 페이지 디자인
	// 2020-08-22 15강 까지 완료 - 프로젝트 완성 및 배포

}
