package mulGameTestDDongData;

// FIXME 2020-07-20 가끔씩 안터지는 버그
// TODO 2020-07-20  fix 완료 => 또 그런 현상 일어 날 수 있음

// FIXME 2020-07-20 PuyoFrame JLabel 중앙 정렬 안됨

// TODO 2020-07-20 PuyoTimer에서 최대속도를 15로 안잡아줌... 나름 괜찮아 보임.. 팀원과 상의후 결정

//1. 나도 상대의 정보를 알고 있어야 아이템을 던질 수 있스무네다.
//
//2. 나의 조건에 맞을때 상대방의 블럭을 건듬....
//
//3. 나의 블럭도 건들어 질수 있기 때문에 나의 블럭을 담은 것도 실시간 확인을 해야 겟구나....
//
//
//
//1. stopChk == false
//2. Label 생성이 되어있어야 하고
//3. Puyo 클래스도 생성이 되어 있어야함 => endMove 사용시 필요
//4. puyoLbs 라는 배열에 들어 있어야함
//
//data 같은색을 모아 놓은 map => 넌 필요 없음
