package memo;

public class Memo {

	// 2회독

	// JSP Ajax 고급 회원제 채팅 사이트 개발하기
	// https://www.youtube.com/watch?v=88eNrWzLk-A&list=PLRx0vPvlEmdAlUbX_TGDxaSxKCvfl2isa

	// 부트스트랩 : https://getbootstrap.com/
	// 제이쿼리 : https://code.jquery.com/jquery-3.1.1.min.js
	// css 템플릿 : https://www.bootdey.com/

	// 2020-09-05 1강 - 프로젝트 소개 및 화면 디자인 (완료)
	// 2020-09-05 2강 - 데이터베이스 커넥션 풀 구축 (강의 : MySQL => 211. UserChat_실시간 회원제 채팅
	// (feat) 동빈나) (custom : Oracle 이용) (완료)
	// 2020-09-05 3강 - 회원 등록 양식 디자인 (완료)
	// 2020-09-05 4강 - 회원가입 DB 기능 구현 (완료)
	// 2020-09-05 5강 - 모달 팝업창 및 회원가입 기능 완성 (완료)

	// 2020-09-06 6강 - 채팅창 디자인 구현 (완료)
	// 2020-09-06 7강 - 채팅 데이터베이스 구축 (완료)
	// 2020-09-06 8강 - 채팅 메시지 전송 기능 구현 (완료)
	// 2020-09-06 9강 - 로그인 디자인 및 기능 구현 (완료)
	// 2020-09-06 10강 - 채팅 내용 불러오기 (완료)

	// 2020-09-07 11강 - 친구찾기 기능 구현 (완료)

	// 2020-09-08 12강 - 메인디자인 개편하기 (완료)
	// 2020-09-08 13강 - 메시지 읽은 처리 기능 구현 (완료)

	// 2020-09-09 14강 - 읽지 않은 메시지 갯수 출력 기능 구현 (완료)
	// 2020-09-09 15강 - 메시지함 기능 구현 (6분 까지 완료)

	// 2020-09-11 15강 - 메시지함 기능 구현 (6분 부터 끝 까지 완료)

	// 2020-09-14 16강 - 메시지함 전송 예외처리 (완료)
	// 2020-09-14 17강 - 대화 상대별 안 읽은 메시지 출력 (완료)
	// 2020-09-14 18강 - 회원정보수정 기능 구현 (완료)

	// 2020-09-16 19강 - 프로필사진 업로드 기능 구현 (완료)

	// 2020-09-23 20강 - 프로필사진 출력 기능 구현 (완료)

	// 2020-09-24 21강 - 회원제 댓글형 게시판 설계 (완료)
	// 2020-09-24 22강 - 파일 및 게시글 등록 기능 구현 (완료)

	// 2020-09-26 23강 - 게시판 글 목록 출력 기능 구현 (완료)
	// 2020-09-26 24강 - 게시글 첨부파일 다운로드 기능 구현 (완료)
	// 2020-09-26 - NetWork 연습 (완료)
	// 2020-09-26 - File 연습 (완료)

	// -------------많은 복습 필요 구간-----------
	// 2020-09-27 25강 - 게시글 수정 기능 구현 (완료)
	// 2020-09-27 26강 - 게시글 삭제 기능 구현 (완료)
	// 2020-09-27 27강 - 게시글 답변 기능 구현 (완료)
	// -------------------------------------

	// 2020-09-28 28강 - 답변 들여쓰기 유지를 위한 개편 (완료)
	// 2020-09-28 29강 - 게시판 페이징 처리 구현 (완료)

}
