package memo;

public class Memo {

	// 2회독

	// JSP 강의평가 웹 사이트 개발하기(email send 기능 + 검색기능)
	// https://www.youtube.com/watch?v=hke9FKluXow&list=PLRx0vPvlEmdAdWCQeUPnyMZ4PsW3dGuFB&index=1

	// 부트스트랩 : https://getbootstrap.com/
	// 제이쿼리 : https://code.jquery.com/jquery-3.5.1.min.js
	// poper : https://popper.js.org/
	// 구글폰트 : https://fonts.google.com/earlyaccess

	// 2020-09-29 1강 - 강의소개 및 강사 소개 (완료)
	// 2020-09-29 2강 - 개발환경 구축 및 테스트 (완료)
	// 2020-09-29 3강 - oracle 과 jsp 연동 실습 (완료)
	// 2020-09-29 4강 - 프레임워크로 웹 디자인 틀 잡기 (완료)

	// 2020-09-30 5강 - 강의평가 메인 웹 디자인 (완료)
	// 2020-09-30 6강 - 로그인 및 로그아웃 화면 디자인 (완료)

	// 2020-10-01 7강 - 강의평가 데이터베이스 구축하기 (완료)
	// 2020-10-01 8강 - 회원 데이터 모델링 (완료)

	// 2020-10-02 9강 - 회원가입 및 이메일 인증 구현하기 (완료)
	// 2020-10-02 10강 - 로그인 및 로그아웃 구현 (완료)

	// 2020-10-03 11강 -  강의평가 등록 기능 구현 (완료)
	// 2020-10-03 12강 -  관리자에게 신고기능 구현 (완료)

	// 2020-10-04 13강 -  미니 검색엔진 구현 (완료)
	// 2020-10-04 14강 -  강의 추천 및 삭제 구현하기 (완료)

	// 2020-10-05 15강 -  Xss 방어 및 프로젝트 완료 (완료)
	// DB에서 글을 쓸때 또는 읽을때 처리 해줍니다.
	
	

}
