/* sysdate */ -- today
select sysdate from dual; -- 현재 날짜를 표기 합니다. (20/07/15)

select member.*, sysdate as today, trunc((sysdate - birth) / 365) as age from member; -- 만 나이를 출력
--1	tjddjs90	박성언	Tv봐요	175.5	19/10/13 00:00:00.000000000	90/05/12	20/07/15	30
--2	kyj1211	김영재	영화	159.9	19/10/13 00:00:00.000000000	90/12/11	20/07/15	29
--1	rmftpdy	호이호이	파리리	1	15/05/05 00:00:00.000000000	88/08/08	20/07/15	31
--5	ghdrlfrhd	홍길동	영화		20/02/06 13:00:00.000000000	50/04/25	20/07/15	870
--6	zmflrmaktm	크리스마스	영화		20/03/02 00:00:00.000000000	98/12/25	20/07/15	21
--7	tlrahrdlf	식목일	잠자기		20/03/02 00:00:00.000000000	01/04/05	20/07/15	19

select regdate, trunc(months_between(sysdate, regdate)) as "경 과 일" from member; -- 현재날짜 와 regdate를 비교하여 몇개월이 지났는지 알려줍니다.
--19/10/13 00:00:00.000000000	9
--19/10/13 00:00:00.000000000	9
--15/05/05 00:00:00.000000000	62
--20/02/06 13:00:00.000000000	5
--20/03/02 00:00:00.000000000	4
--20/03/02 00:00:00.000000000	4

select regdate, trunc(add_months(regdate, 6)) as "6개월 뒤의 달 은 ?" from member;
--19/10/13 00:00:00.000000000	20/04/13
--19/10/13 00:00:00.000000000	20/04/13
--15/05/05 00:00:00.000000000	15/11/05
--20/02/06 13:00:00.000000000	20/08/06
--20/03/02 00:00:00.000000000	20/09/02
--20/03/02 00:00:00.000000000	20/09/02

select birth, last_day(birth) as "각 달의 마지막 날" from member;
--90/05/12	90/05/31
--90/12/11	90/12/31
--88/08/08	88/08/31
--50/04/25	50/04/30
--98/12/25	98/12/31
--01/04/05	01/04/30

select regdate, next_day(sysdate, '수') as "다음에 나타날 요일" from member; -- 현재로 부터 다음 수요일을 찾습니다.
select next_day(sysdate, '수') as "다음에 나타날 요일" from member; -- 현재로 부터 다음 수요일을 찾습니다.