/* nvl - null 값을 대체 */

select name, nvl (kor, 0), nvl (eng, 0), nvl (mat, 0), 
nvl (kor + eng + mat, 0) as "총점", 
nvl (trunc((kor + eng + mat) / 3), 0) as "평균",

trunc(nvl (kor, 0) + nvl (eng, 0) + nvl (mat, 0)) as tot,
trunc((nvl (kor, 0) + nvl (eng, 0) + nvl (mat, 0)) / 3) as avg
from exam;

--한가인	97	97	97	291	97	291	97
--두가인	72	37	74	183	61	183	61
--삼가인	17	27	77	121	40	121	40
--사가인	74	47	77	198	66	198	66
--오가인	17	65	43	125	41	125	41
--육가인	78	56	35	169	56	169	56
--칠가인	98	86	85	269	89	269	89
--팔가인	78	76	75	229	76	229	76
--구가인	18	36	85	139	46	139	46
--십가인	48	76	37	161	53	161	53
--십일가인	58	96	95	249	83	249	83
--십이가인	68	66	65	199	66	199	66
--십삼가인	100	97	13	210	70	210	70